EDT/ZUP/zup_edt/src/Documents/ПланОбученияРазвития/ПланОбученияРазвития.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланОбученияРазвития</name>
  <registerRecords>InformationRegister.ПланОбученияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПланОбученияПоМероприятиям</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Мероприятия</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>CatalogRef.МероприятияОбученияРазвития</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчебныхЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСотрудников</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаВключениеВПланОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиМероприятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>НомерСтрокиМероприятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНаСотрудника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ПланОбученияРазвития/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ПланОбученияРазвития.ДанныеДляПроведения(Ссылка);
	
	ОбучениеРазвитие.СформироватьДвиженияПланаПоМероприятиям(Движения, ДанныеДляПроведения.ПлановыеДвиженияМероприятий);
	ОбучениеРазвитие.СформироватьДвиженияПланаПоСотрудникам(Движения, ДанныеДляПроведения.ПлановыеДвиженияСотрудников);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Согласован = Ложь;
		Утвердил = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	Для каждого Мероприятие Из Мероприятия Цикл
		
		// Рассчитываем сумму по каждому сотруднику.
		СотрудникиМероприятия = Сотрудники.НайтиСтроки(Новый Структура("НомерСтрокиМероприятия",Мероприятие.НомерСтрокиМероприятия));
		
		Если СотрудникиМероприятия.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Мероприятие.КоличествоСотрудников = 0 Тогда
			СуммаНаЧеловека = Мероприятие.СуммаРасходов;
		Иначе
			СуммаНаЧеловека = Окр(Мероприятие.СуммаРасходов / Мероприятие.КоличествоСотрудников, 2);
		КонецЕсли;
		
		НадоРаспределитьВсюСумму = (Мероприятие.КоличествоСотрудников = СотрудникиМероприятия.Количество());
		
		Для каждого Сотрудник Из СотрудникиМероприятия Цикл
			Сотрудник.СуммаНаСотрудника = СуммаНаЧеловека;
			
			Если СотрудникиМероприятия.Найти(Сотрудник) = СотрудникиМероприятия.Количество() - 1
				И НадоРаспределитьВсюСумму Тогда 
				
				Сотрудник.СуммаНаСотрудника = Сотрудник.СуммаНаСотрудника + 
					(Мероприятие.СуммаРасходов - СотрудникиМероприятия.Количество() * СуммаНаЧеловека);
			КонецЕсли;
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачалаПланирования, "Объект.ДатаНачалаПланирования", Отказ, НСтр("ru='Начало периода планирования'"), , , Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ПересекаютсяПериодыПланирования() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Уже существуют планы обучения, введенные в этом периоде. Пожалуйста, проверьте даты планирования.'"),
			ЭтотОбъект,
			"ДатаНачалаПланирования",,
			Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаПланирования"); 		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияПланирования"); 
	КонецЕсли;
	
	// Проверка периодов мероприятий
	Для каждого Мероприятие Из Мероприятия Цикл
		Если НЕ ЗначениеЗаполнено(Мероприятие.ДатаНачала)
			ИЛИ Мероприятие.ДатаНачала > Мероприятие.ДатаОкончания
			ИЛИ Мероприятие.ДатаНачала < ДатаНачалаПланирования
			ИЛИ Мероприятие.ДатаНачала > ДатаОкончанияПланирования Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru ='Неверно заполнен период.'"),
				ЭтотОбъект,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Мероприятия[%1].ДатаНачала", Мероприятия.Индекс(Мероприятие)),,
				Отказ);
				
		ИначеЕсли НЕ ЗначениеЗаполнено(Мероприятие.ДатаОкончания)
			ИЛИ Мероприятие.ДатаОкончания < ДатаНачалаПланирования
			ИЛИ Мероприятие.ДатаОкончания > ДатаОкончанияПланирования Тогда
			
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru ='Неверно заполнен период.'"),
				ЭтотОбъект,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Мероприятия[%1].ДатаОкончания", Мероприятия.Индекс(Мероприятие)),,
				Отказ);
			
		КонецЕсли;
	КонецЦикла; 

	Если НЕ Согласован Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Утвердил");
	КонецЕсли;
	
	ПроверитьПодчиненнуюТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(Отказ);
	
	МассивНепроверяемыхРеквизитов.Добавить("Мероприятие.ДатаНачала");
	МассивНепроверяемыхРеквизитов.Добавить("Мероприятие.ДатаОкончания");

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПересекаютсяПериодыПланирования()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланОбученияПоМероприятиям.Мероприятие
		|ИЗ
		|	РегистрСведений.ПланОбученияПоМероприятиям КАК ПланОбученияПоМероприятиям
		|ГДЕ
		|	ПланОбученияПоМероприятиям.Подразделение = &Подразделение
		|	И ПланОбученияПоМероприятиям.ДатаНачалаПланирования <= &ДатаОкончанияПланирования
		|	И ПланОбученияПоМероприятиям.ДатаОкончанияПланирования >= &ДатаНачалаПланирования
		|	И ПланОбученияПоМероприятиям.Регистратор <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачалаПланирования", ДатаНачалаПланирования);
	Запрос.УстановитьПараметр("ДатаОкончанияПланирования", ДатаОкончанияПланирования);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

Процедура ПроверитьПодчиненнуюТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(Отказ)

	ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники.ВыгрузитьКолонку("Сотрудник"), "ФизическоеЛицо");
	
	Для каждого СтрокаМероприятия Из Мероприятия Цикл
		НайденныеСотрудники = Сотрудники.НайтиСтроки(Новый Структура("НомерСтрокиМероприятия", СтрокаМероприятия.НомерСтрокиМероприятия));
		СписокФизическихЛиц = Новый Соответствие;
		
		Для каждого СтрокаСотрудника Из НайденныеСотрудники Цикл
			ФизическоеЛицо = ФизическиеЛицаСотрудников[СтрокаСотрудника.Сотрудник];
			Если СписокФизическихЛиц.Получить(ФизическоеЛицо) = Неопределено Тогда
				СписокФизическихЛиц.Вставить(ФизическоеЛицо, Истина);
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru ='%1 уже подобран в данное мероприятие.'"), СтрокаСотрудника.Сотрудник),
				ЭтотОбъект,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Мероприятия[%1].Мероприятие", Мероприятия.Индекс(СтрокаМероприятия)),,
				Отказ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
